
const MOVIE_DURATIONS = {
    "ОДІССЕЯ": 180,
    "АКАДЕМІЯ ЧАРІВНИКІВ": 120,
    "ІСТОРІЯ ІГРАШОК 5": 105,
    "ПОСІПАКИ І МОНСТРЯКИ": 95,
    "ТЕСТ НА ТЕЩУ 2": 99,
    "БРУДНІ ГРОШІ": 104,
    "ПОКИ СМЕРТЬ НЕ РОЗЛУЧИТЬ НАС": 100,
    "ОБСЕСІЯ": 105,
    "ПРОБУДЖЕННЯ: ЧЕРНИЦЯ З БОРЛІ": 97
    };

const DEFAULT_DURATION = 120;

const TIME_EXCEPTIONS = {
    "ОДІССЕЯ": { 
        "19:40": { duration: 170 }
    },
    "ОБСЕСІЯ": { 
        "20:20": { duration: 111 } 
    }
};

const EXTRA_SESSIONS = [
    {
        date: "2026-07-28", // Змініть на потрібну вам дату
        time: "15:55",
        movieName: "Історія Іграшок Табір",
        hall: "LUX 8",
        duration: 101, // 2.5 години
        sold: 22
    }
];
