
const MOVIE_DURATIONS = {
    "ОДІССЕЯ": 179,
    "АКАДЕМІЯ ЧАРІВНИКІВ": 120,
    "ІСТОРІЯ ІГРАШОК 5": 103,
    "ПОСІПАКИ І МОНСТРЯКИ": 94,
    "БРУДНІ ГРОШІ": 104,
    "ТЕСТ НА ТЕЩУ 2": 99,
    "ПОКИ СМЕРТЬ НЕ РОЗЛУЧИТЬ НАС": 100,
    "ОБСЕСІЯ": 105,
    "ПРОБУДЖЕННЯ: ЧЕРНИЦЯ З БОРЛІ": 97,
    "ЛЮДИНА-ПАВУК: АБСОЛЮТНО НОВИЙ ДЕНЬ": 140,
    "ЗАГНАНИЙ": 121,
    "ЩЕНЯЧИЙ ПАТРУЛЬ: ДИНОФІЛЬМ": 90,
    "МОТОР СІТІ": 108,
    "ПОГРАБУВАННЯ БАНКУ: НЕСТАНДАРТНИЙ МЕТОД": 98,
    "МОРОЗИВНИК": 89
    };

const DEFAULT_DURATION = 120;

const TIME_EXCEPTIONS = {
    "ОДІССЕЯ": { 
        "19:40": { duration: 170 }
    },
    "ОБСЕСІЯ": { 
        "20:20": { duration: 111 } 
    },
    "ЛЮДИНА-ПАВУК: АБСОЛЮТНО НОВИЙ ДЕНЬ": {
        "20:25": { duration: 136 },
    },
    "ЗАГНАНИЙ": {
        "20:55": { duration: 112}
    },
    "ПОСІПАКИ І МОНСТРЯКИ": {
        "14:00": {duration: 84}
    }
};

const EXTRA_SESSIONS = [
    {
        date: "2026-07-28", // Змініть на потрібну вам дату
        time: "15:55",
        movieName: "Історія Іграшок Табір",
        hall: "LUX 6",
        duration: 91,
        sold: 22
    },
    
    {
        date: "2026-08-02",
        time: "16:00",
        movieName: "ОРЕНДА",
        hall: "LUX 6",
        duration: 300,
        sold: 16
    }
];
